Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Example 54.18. Providing a library dependency to the binary
zh_cn: 示例 54.18. 向二进制文件提供库依赖

source: Example 54.19. Declaring project dependencies
zh_cn: 示例 54.19. 定义项目依赖

source: Example 54.2. Defining executable components
zh_cn: 示例 54.2. 定义可执行组件

source: Example 54.20. Defining build types
zh_cn: 示例 54.20. 定义构建类型

source: Example 54.21. Configuring debug binaries
zh_cn: 示例 54.21. 配置debug二进制文件

source: Example 54.22. Defining platforms
zh_cn: 示例 54.22. 定义platform

source: Example 54.23. Defining flavors
zh_cn: 示例 54.23. 定义flavors

source: Example 54.24. Targeting a component at particular platforms
zh_cn: 示例 54.24. 针对一个组件的特定平台

source: Example 54.25. Building all possible variants
zh_cn: 示例 54.25. 构建所有可能的变种

source: Example 54.26. Defining tool chains
zh_cn: 示例 54.26. 定义工具链

source: Example 54.27. Registering CUnit tests
zh_cn: 示例 54.27. 注册 CUnit 测试

source: Example 54.28. Registering CUnit tests
zh_cn: 示例 54.28. 注册 CUnit 测试

source: Example 54.29. Running CUnit tests
zh_cn: 示例 54.29. 运行 CUnit 测试

source: Example 54.3. The 'cpp' plugin
zh_cn: 示例 54.3. cpp 插件

source: Example 54.4. C++ source set
zh_cn: 示例 54.4. C++ 源代码集

source: Example 54.5. The 'c' plugin
zh_cn: 示例 54.5. “C” 插件

source: Example 54.6. C source set
zh_cn: 示例 54.4. C 源代码集

source: Example 54.7. The 'assembler' plugin
zh_cn: 示例 54.3. assembler 插件

source: Example 54.8. The 'objective-c' plugin
zh_cn: 示例 54.8. “objective-c”插件

source: Example 54.9. The 'objective-cpp' plugin
zh_cn: 示例 54.9. “objective-cpp” 插件

source: Example 55.1. Single project build
zh_cn: 示例 55.1. 单项目构建

source: Example 55.2. Hierarchical layout
zh_cn: 示例 55.2. 分层布局

source: Example 55.3. Flat layout
zh_cn: 示例 55.3. 平面布局

source: Example 55.4. Modification of elements of the project tree
zh_cn: 示例 55.4. 修改项目树中的元素

source: Example 55.5. Modification of elements of the project tree
zh_cn: 示例 55.5. 修改项目树中的元素

source: Example 55.6. Adding of test task to each project which has certain property set
zh_cn: 示例 55.6. 向每个包含某些属性设置的project 添加测试任务

source: Example 55.7. Notifications
zh_cn: 示例 55.7. 通知

source: Example 55.8. Setting of certain property to all tasks
zh_cn: 示例 55.8. 对所有的任务设置一些属性

source: Example 55.9. Logging of start and end of each task execution
zh_cn: 示例55.9. 在每个任务执行的开始及结束时打印日志

source: Example 56.1. Multi-project tree - water & bluewhale projects
zh_cn: 示例 56.1. 多项目树- water & bluewhale 项目

source: Example 56.10. Running build from subproject
zh_cn: 示例 56.10. 从子项目的运行构建

source: Example 56.11. Evaluation and execution of projects
zh_cn: 示例 56.11. 项目的评估和执行

source: Example 56.12. Evaluation and execution of projects
zh_cn: 示例 56.12. 项目的评估和执行

source: Example 56.13. Running tasks by their absolute path
zh_cn: 示例56.13. 按绝对路径运行任务

source: Example 56.14. Dependencies and execution order
zh_cn: 示例 56.14. 依赖和执行顺序

source: Example 56.15. Dependencies and execution order
zh_cn: 示例 56.15. 依赖和执行顺序

source: Example 56.16. Dependencies and execution order
zh_cn: 示例 56.16. 依赖和执行顺序

source: Example 56.17. Declaring dependencies
zh_cn: 示例 56.17. 声明依赖

source: Example 56.18. Declaring dependencies
zh_cn: 示例 56.18. 声明依赖

source: Example 56.19. Cross project task dependencies
zh_cn: 56.19. 跨项目任务依赖

source: Example 56.2. Build script of water (parent) project
zh_cn: 示例 56.2. water（父）项目的构建脚本

source: Example 56.20. Configuration time dependencies
zh_cn: 示例 56.20. 配置时依赖

source: Example 56.21. Configuration time dependencies - evaluationDependsOn
zh_cn: 示例 56.21. 配置时依赖——evaluationDependsOn

source: Example 56.22. Configuration time dependencies
zh_cn: 示例 56.22. 配置时依赖

source: Example 56.23. Dependencies - real life example - crossproject configuration
zh_cn: 示例 56.23. 依赖——真实生活中的例子——跨项目配置

source: Example 56.24. Project lib dependencies
zh_cn: 56.24. 项目库依赖

source: Example 56.25. Project lib dependencies
zh_cn: 示例 56.25. 项目库依赖

source: Example 56.26. Fine grained control over dependencies
zh_cn: 示例 56.26. 对依赖的细粒度的控制

source: Example 56.27. Build and Test Single Project
zh_cn: 示例 56.27. 构建和测试单个项目

source: Example 56.28. Partial Build and Test Single Project
zh_cn: 示例 56.28. 部分构建和测试单个项目

source: Example 56.29. Build and Test Depended On Projects
zh_cn: 示例 56.29. 构建和测试被依赖的项目

source: Example 56.3. Multi-project tree - water, bluewhale & krill projects
zh_cn: 示例 56.3. 多项目树- water & bluewhale & krill 项目

source: Example 56.30. Build and Test Dependent Projects
zh_cn: 示例 56.30. 构建和测试依赖它的项目

source: Example 56.4. Water project build script
zh_cn: 示例 56.4. Water项目构建脚本

source: Example 56.5. Defining common behaviour of all projects and subprojects
zh_cn: 示例 56.5. 定义所有项目以及子项目的共同行为

source: Example 56.6. Defining specific behaviour for particular project
zh_cn: 示例 56.6. 为特定项目定义特定行为

source: Example 56.7. Defining specific behaviour for project krill
zh_cn: 示例 56.7. 为krill项目定义特定的行为

source: Example 56.8. Adding custom behaviour to some projects (filtered by project name)
zh_cn: 示例 56.8. 将自定义行为添加到某些项目中（按项目名称筛选）

source: Example 56.9. Adding custom behaviour to some projects (filtered by project properties)
zh_cn: 示例 56.9. 将自定义行为添加到某些项目中（按项目属性筛选）

source: Example 57.1. Defining a custom task
zh_cn: 示例 57.1. 定义一个自定义任务

source: Example 57.2. A hello world task
zh_cn: 示例 57.2. 一个hello world 任务

source: Example 57.3. A customizable hello world task
zh_cn: 示例 57.3. 一个自定义的hello world任务

source: Example 9.2. Dependency on Groovy 2.2.0
zh_cn: 示例 9.2. 依赖 Groovy 2.2.0

source: Except where noted in theAPI documentation, the Zinc based compiler supports exactly the same configuration options as the Ant based compiler.
zh_cn: 除非在API 文档中另有说明，否则基于 Zinc 的据编译器支持与基于 Ant 的编译器完全相同的配置选项。

source: Excluding tasks
zh_cn: 排除任务

source: Execute gradle sonarRunner and wait until the build has completed, then open the web page indicated at the bottom of the Sonar Runner output.
zh_cn: 执行gradle sonarRunner并等待构建完成，然后打开 Sonar Runner 输出结果的底部所指示的网页。

source: Execute ignoring dependencies.
zh_cn: 执行忽略依赖关系。

source: Executing multiple tasks
zh_cn: 执行多个任务

source: Execution
zh_cn: 执行

source: Existing module descriptors are ignored.
zh_cn: 现有的模块描述符将被忽略。

source: Extends
zh_cn: 继承自

source: Extensive configuration defaults
zh_cn: 提供了广泛范围的默认配置

source: External dependencies
zh_cn: 外部依赖

source: External module dependencies are the most common dependencies.
zh_cn: 外部模块依赖是最常见的依赖。

source: External module dependency
zh_cn: 外部模块依赖

source: Extra properties can be added, read and set via the owning object's ext property.
zh_cn: 额外的属性可以通过所属对象的ext属性进行添加，读取和设置。

source: Extra properties on a parent project are visible from subprojects.
zh_cn: 父项目上的额外属性，在子项目中也可以访问。

source: Extra task properties
zh_cn: 额外任务属性

source: Fast and accurate bash tab completion.
zh_cn: 快速、 准确的 bash 的 tab 键完成。

source: Favorites
zh_cn: 收藏夹

source: Features
zh_cn: 特性

source: Figure 23.1. Java plugin - tasks
zh_cn: 图23.1. Java插件 ​​- 任务

source: Figure 23.2. Java plugin - dependency configurations
zh_cn: 图23.2. Java插件 ​​- 依赖配置

source: Figure 24.1. Groovy plugin - tasks
zh_cn: 图 24.1. Groovy 插件 - tasks

source: Figure 25.1. Scala plugin - tasks
zh_cn: 图 25.1. Scala 插件-任务

source: Figure 26.1. War plugin - tasks
zh_cn: 图 26.1. War 插件 - tasks

source: Figure 28.1. Jetty plugin - tasks
zh_cn: 图 28.1. Jetty 插件 - tasks

source: File collections
zh_cn: 文件集合

source: File dependencies allow you to directly add a set of files to a configuration, without first adding them to a repository.
zh_cn: 文件依赖允许你直接将一组文件添加到配置中，而不用先将它们添加到存储库。

source: File dependencies are not included in the published dependency descriptor for your project.
zh_cn: 文件依赖项不会包含在你的项目的发布的依赖描述中。

source: File dependency
zh_cn: 文件依赖

source: File trees
zh_cn: 文件树

source: File-level test selection does not support many interesting scenarios that are possible with test-level filtering.
zh_cn: file-level 的测试选择不支持的很多有趣的情况，都可以用 test-level 过滤来做到。

source: Filtering at the level of specific test methods; executing a single test method
zh_cn: 在指定的测试的方法级别上进行过滤；执行单个测试方法

source: Filtering based on custom annotations (future)
zh_cn: 基于自定义注解（以后实现）进行过滤

source: Filtering based on some custom runtime rule, e.g. particular value of a system property or some static state (future)
zh_cn: 基于一些自定义的运行时的规则进行过滤，例如某个系统属性或一些静态的特定值（以后实现）

source: Filtering based on test hierarchy; executing all tests that extend ceratain base class (future)
zh_cn: 基于测试层次结构进行过滤 ；执行所有继承了某一基类（以后实现） 的测试

source: Filtering is a different mechanism than test class inclusion / exclusion that will be described in the next few paragraphs (-Dtest.single, test.include and friends).
zh_cn: 过滤，相对于测试类的包含或排除，是一个不同的机制。它将在接下来的段落中进行描述（-Dtest.single， test.include和friends）。

source: Finalizer task will be executed even if the finalized task fails.
zh_cn: 即使最终的任务执行失败，析构器任务也会被执行。

source: Finalizer tasks
zh_cn: 析构器任务

source: Finalizer tasks are automatically added to the task graph when the finalized task is scheduled to run.
zh_cn: 当最终的任务准备运行时，析构器任务会自动地添加到任务图中。

source: Finalizer tasks are useful in situations where build creates a resource that has to be cleaned up regardless of the build failing or succeeding.
zh_cn: 在不管构建成功或是失败，都必须清理创建的资源的情况下，析构认为是很有用的。

source: Finalizers tasks are an incubating feature (see Section C.1.2, “Incubating”).
zh_cn: 析构器任务是一个 孵化中 的功能 (请参阅 C.1.2 章节， “Incubating”)。

source: Finally, send announcements with the announce method:
zh_cn: 最后，使用announce方法发送公告：

source: Finally, since build scripts are Groovy scripts, you can always execute an Ant build as an external process.
zh_cn: 最后，由于构建脚本是 Groovy 脚本，所以您始终可以作为一个外部进程来执行 Ant 构建。

source: Finally, you could move your tasks across to your build file, or replace them with some of Gradle's plugins.
zh_cn: 最后，您可以将整个任务移动到您的构建文件，或者把它们替换为一些 Gradle 插件。

source: Finally, you may want to build and test everything in all projects.
zh_cn: 最后，你可能想要构建和测试所有项目的所有内容。

source: First shared is built and then api is built.
zh_cn: 首先会先构建shared，然后构建api 。

source: First, the copy() is not incremental (see Section 15.9, “Skipping tasks that are up-to-date”).
zh_cn: 首先， copy()不能进行增量操作（见15.9章节，"跳过处于最新状态的任务"）。

source: First, you need to tell Gradle to use the parallel mode.
zh_cn: 首先，你需要告诉 Gradle 使用并行模式。

source: Firstly if using that rule introduces an ordering cycle.
zh_cn: 首先是如果使用这一规则引入了一个排序循环。

source: Firstly, each task is available as a property of the project, using the task name as the property name:
zh_cn: 首先，每个任务都可作为项目的一个属性，并且使用任务名称作为这个属性名称：

source: Flat directory repository
zh_cn: Flat 目录仓库

source: For 3rd party plugins however, you need to make the plugins available to the build classpath.
zh_cn: 然而，对于第三方插件，你需要进行配置以使插件在构建类路径中可用。

source: For ScalaCompile tasks added by the Scala plugin, no configuration is necessary to make this work.
zh_cn: 对于由 Scala 插件添加的ScalaCompile任务，无需对这一点进行配置。

source: For CI builds and release builds, we currently recommend to use the Ant based compiler.
zh_cn: 对于 CI 构建和版本的构建中，我们目前推荐使用基于 Ant 的编译器。

source: For GCC running on Windows via Cygwin, platforms 'windows/x86' and 'windows/x86_64' are supported.
zh_cn: 对于通过Cygwin运行在Windows上的GCC，则支持“windows/x86”和“windows/x86_64”。

source: For Gradle the two action tasks are just not related.
zh_cn: 对于 Gradle 而言，这两个action任务不相关。

source: For Maven repositories, this is done using the maven-metadata.xml file, while for Ivy repositories this is done by directory listing.
zh_cn: 对于 Maven 仓库，是通过maven metadata.xml文件来实现，而对于 Ivy 存储库，则是通过目录列表。

source: For a build script, the property access and method calls are delegated to a project object.
zh_cn: 对于一个构建脚本，属性的访问和方法的调用会委派给一个project对象。

source: For a build type, a Gradle project will typically define a set of compiler/linker flags per tool chain.
zh_cn: 对于一个构建类型，Gradle project 通常会定义一组每个工具链的编译器/链接器标志。

source: For a complete list of standard Sonar properties, consult the Sonar documentation.
zh_cn: 对于标准的 Sonar 属性的完整列表，请参阅 Sonar 文档。

source: For a complete list of supported Javadoc options consult the API documentation of the following classes: CoreJavadocOptions and StandardJavadocDocletOptions.
zh_cn: 对于支持的 Javadoc 参数选项的完整列表，请参考下面的类的 API 文档： CoreJavadocOptions和StandardJavadocDocletOptions。

source: For a component produced in a different Gradle project, the notation is similar.
zh_cn: 对于在不同的 Gradle 项目产生的组件，notation是类似的。

source: For a default component, Gradle will attempt to create a native binary variant for each and every combination of buildType, platform and flavor defined for the project.
zh_cn: 对于一个默认的组件， Gradle会尝试为这个project所定义的每一个buildType， platform 和 flavor，以及它们的每一种组合，创建一个本地二进制变种。

source: For a dynamic version, a 'higher' static version is preferred over a 'lower' version.
zh_cn: 对于动态版本，“高”的静态版本优于“低”的版本。

source: For a flat layout you must additionally obey to the naming convention described above.
zh_cn: 对于平面布局你必须另外服从上面描述的命名约定。

source: For a given variant, Gradle will attempt to find a ToolChain that is able to build for the target platform.
zh_cn: 对于给定的变种，Gradle 将尝试查找能够构建目标平台的ToolChain。

source: For a given variant, Gradle will attempt to locate a ToolChain that is able to build for the target platform.
zh_cn: 对于给定的变种，Gradle 将尝试查找能够构建目标平台的ToolChain。

source: For a library named 'main', files in src/main/headers are considered the “public” or “exported” headers.
zh_cn: 对于名字为“main”的library， src/main/headers中的文件都被视为"公共"或"导出"的头文件。

source: For a multi-project build these are the projects specified in Settings object (plus the root project).
zh_cn: 对于多项目构建，则有在 Setting 对象中指定的project（加上根项目的project）。

source: For a multi-project build, all projects with native components should have this plugin applied.
zh_cn: 对于多项目构建，所有带有本地组件的project都应该应用这个插件。

source: For a new version, you have always to create the new XML descriptor and the directories.
zh_cn: 对一个新的版本，你总是要创建新的 XML 描述符和目录。

source: For a single project build this is only one project.
zh_cn: 对于单项目构建，只有一个project。

source: For a single project build, the workflow of the after initialization phases are pretty simple.
zh_cn: 对于一个单项目构建，初始化后阶段的工作流都相当简单。

source: For a single-project build, a settings file is optional.
zh_cn: 对于单项目的构建，有没有设置文件都可以。

source: For a task to be “signable”, it must produce an archive of some type.
zh_cn: 一个“可签名”的任务，必须输出某种类型的archive。

source: For above sorts of workflows, it is important that the startup cost of invoking Gradle is as small as possible.
zh_cn: 对以上各种工作流来说，让调用 Gradle 的启动成本尽可能小会很重要。

source: For adding a custom Maven repository you can do:
zh_cn: 要添加一个自定义的 Maven 仓库，你可以如下操作：

source: For an example, see ResolutionStrategy.
zh_cn: 有关示例，请参见ResolutionStrategy。

source: For an open source project it looks like overkill.
zh_cn: 而对于一个开放源码项目而言，看起来则有点小题大做了。

source: For best results, it is therefore recommended to run a full build before the analysis.
zh_cn: 为获得最佳结果，建议在分析前运行一次完整的构建。

source: For command line usage take a look dedicated section in Appendix D, Gradle Command Line.
zh_cn: 关于命令行的用法，可以看一下专题附录 D， Gradle 命令行。

source: For configuring a third-party Sonar plugin, consult the plugin's documentation.
zh_cn: 对于第三方 Sonar 插件的配置，请参阅插件的文档。

source: For dependencies from a Maven repository, the default configuration is the only available one anyway.
zh_cn: 对于 Maven 存储库的依赖，至少默认配置是唯一可用的一个。

source: For details on how to use the listener interfaces, refer to the API documentation.
zh_cn: 有关如何使用监听器接口的详细信息，请参阅 API 文档。

source: For each NativeBinary that can be produced by a build, a single lifecycle task is constructed that can be used to create that binary, together with a set of other tasks that do the actual work of compiling, linking or assembling the binary.
zh_cn: 针对由构建所产生的每一个 NativeBinary，我们构造了一个生命周期任务用于创建二进制，以及一系统的其他做实际工作，如编译，链接或者是装配二进制文件的任务。

source: For each TestSuiteExecutableBinary, Gradle will create a task to execute this binary, which will run all of the registered CUnit tests.
zh_cn: 对于每个TestSuiteExecutableBinary，Gradle 将创建一个任务来执行此二进制文件，这项任务将运行所有注册的 CUnit 测试。

source: For each Executable and Library defined in your project, Gradle will create a matching CUnitTestSuite component, named ${component.name}Test.
zh_cn: 对于在你的项目中定义的每一个 Executable 和 Library，Gradle将创建一个匹配的 CUnitTestSuite 组件，名字为${component.name}Test。

source: For each ProjectNativeBinary configured for the main component, a matching TestSuiteExecutableBinary will be configured on the test suite component.
zh_cn: 对于为main 组件配置的每一个ProjectNativeBinary，在测试套件组件上都会配置一个匹配的 TestSuiteExecutableBinary 。

source: For each executable or library defined, Gradle adds a FunctionalSourceSet with the same name.
zh_cn: 对于每个定义的executable或library，Gradle 添加了具有相同名称的FunctionalSourceSet 。

source: For each configuration in your project, Gradle provides the tasks uploadConfigurationName and buildConfigurationName.
zh_cn: 对于你的项目中的每一个配置，Gradle 提供了uploadConfigurationName和buildConfigurationName任务。

source: For each executable binary produced, the cpp plugin provides an install${binary.name} task, which creates a development install of the executable, along with the shared libraries it requires.
zh_cn: 对于每个产生的可执行二进制文件， cpp插件提供了install${binary.name}任务，这个任务可以创建该可执行文件及它需要的共享库的开发安装。

source: For each executable or library defined, Gradle is able to build a number of different native binary variants.
zh_cn: 对于每个定义的可执行文件或库，Gradle 能够构建多个不同的本机二进制变种。

source: For each extra distribution set you add to the project, the distribution plugin adds the following tasks:
zh_cn: 对于你向项目中添加的每一个额外的分发集合，分发插件会添加下列任务：

source: For each of these 'variant dimensions', it is possible to specify a set of available values as well as target each component at one, some or all of these.
zh_cn: 对于这里的每一个“变种维度”，它可以指定一组可用的值，并且针对每个组件使用这里的一个或多个或全部的值。

source: For each project in the build, Gradle creates an instance of type Project and associates this Project object with the build script.
zh_cn: 在构建的每一个项目中，Gradle 创建了一个Project类型的实例，并在构建脚本中关联此Project对象。

source: For each source set you add to the project, the Java plugin adds the following compilation tasks:
zh_cn: 对于每个你添加到该项目中的源集，Java 插件将添加以下的编译任务：

source: For each source set you add to the project, the Java plugins adds the following dependency configurations:
zh_cn: 对于每个你添加到项目中的源集，Java插件都会添加以下的依赖配置：

source: For exact details on when exactly new daemon process is forked read the dedicated section below.
zh_cn: 关于fork一个完全新的守护进程的具体细节，请阅读下面的专题。

source: For example :bluewhale:hello.
zh_cn: 例如 :bluewhale:hello。

source: For example cleanJar will delete the JAR file created by the jar task, and cleanTest will delete the test results created by the test task.
zh_cn: 例如， cleanJar将删除由jar任务中所创建的 JAR 文件，cleanTest将删除由test任务所创建的测试结果。

source: For example if you run a build on a continuous integration server where you have no admin rights for the machine.
zh_cn: 例如，如果你在一个持续集成服务器上运行构建，但你没有这台机器的管理员权限，

source: For example if you want to exchange a task added by the Java plugin with a custom task of a different type.
zh_cn: 例如，您想要把通过 Java 插件添加的一个任务与不同类型的一个自定义任务进行交换。

source: For example there might be a project which uses Hibernate 2.5.
zh_cn: 例如可能有一个项目使用 Hibernate 2.5。

source: For example we will not fork a new daemon if a some system property has changed.
zh_cn: 例如，如果某些系统属性已经更改，我们不会fork一个新的守护进程。

source: For example you can configure your build to generate code coverage using the application plugin.
zh_cn: 例如，你可以配置您的构建使用application插件来生成代码覆盖率。

source: For example you can use a shared flat directory without XML descriptors and yet you can have full transitive dependency management as described above.
zh_cn: 例如你可以使用一个共享平面目录，而不包括如上所述可以有完全的传递依赖管理的XML 描述符。

source: For example, dependency configurations implement FileCollection.
zh_cn: 比如，依赖配置 就实现了 FileCollection 这一接口。

source: For example, Iterable gets an each method, which iterates over the elements of the Iterable:
zh_cn: 例如， iterable 新增的each方法，会对iterable 的元素进行遍历：

source: For example, gradle buildDashboard build will generate a dashboard for all of the reporting tasks that are dependents of the build task.
zh_cn: 例如， gradle buildDashboard build 将为 build任务 所依赖的所有报告任务生成一个 dashboard。

source: For example, a Groovy class can extend a Java class that in turn extends a Groovy class.
zh_cn: 例如，一个 Groovy 类可以继承自一个 Java 类，而这个 Java 类也可以继承自一个 Groovy 类。

source: For example, a Scala class can extend a Java class that in turn extends a Scala class.
zh_cn: 例如，一个 Scala 类可以继承自一个 Java 类，而这个 Java 类也可以继承自一个 Scala 类。

source: For example, a file tree might represent a directory tree or the contents of a ZIP file.
zh_cn: 例如，文件树可能表示一个目录树或 ZIP 文件的内容。

source: For example, a path 'services:api' is mapped by default to a folder 'services/api' (relative from the project root).
zh_cn: 例如，一个路径 'services:api'，默认情况下映射到文件夹'services/api'（相对于项目根目录）。

source: For example, a plugin may define a range of support platforms, but you may choose to only target Windows-x86 for a particular component.
zh_cn: 例如，一个插件可以定义一系列的支持平台，但你可以选择某个特定组件只构建Windows-x86平台。

source: For example, both the Groovy and Scala compilers have a large startup cost.
zh_cn: 例如，Groovy 和 Scala 的编译器启动开销都很大。

source: For example, for a source set called intTest, you can run gradle intTestClasses to compile the int test classes.
zh_cn: 例如，对于一个被叫做intTest的源集，你可以运行gradle intTestClasses来编译 int 测试类。

source: For example, it will infer a type value of "pom" if it finds a pom.xml to convert to a Gradle build.
zh_cn: 例如，如果它发现pom.xml，它将推断一个“pom”的类型值，以转换为 Gradle 构建。

source: For example, one common pattern is an Ant project with version-less jar files stored in the filesystem.
zh_cn: 例如，一个常见的模式是，有一个 Ant 项目，而它保存在文件系统中的一些 jar 文件缺少版本号。

source: For example, setting the skip property to true prevents a project (and its subprojects) from being analyzed.
zh_cn: 例如，设置 skip 属性为true 以防止一个项目（和它的子项目）被分析。

source: For example, some other dependency, which does not have any exclude rules, might pull in that unwanted transitive dependency.
zh_cn: 例如，某些其他的依赖，并没有任何排除规则，可能会带上那个多余的传递依赖。

source: For example, the JavaCompile task has a source property, which defines the source files to compile.
zh_cn: 例如， JavaCompile任务有一个source属性，定义了要编译的源代码文件。

source: For example, the Java plugin configures a jar to built and this jar artifact is added to the archives configuration.
zh_cn: 例如， Java 插件配置了构建一个jar文件，并且把 jar 文件添加到archives配置。

source: For example, the archive tasks are tasks of types: Jar, Tar, Zip.
zh_cn: 例如，以下类型的归档任务： Jar，Tar，Zip。

source: For example, the daemon might be useful for following scenarios:
zh_cn: 例如，该守护进程可能用于以下情形：

source: For example, the keyword style does not work in expressions.
zh_cn: 例如，在表达式中不能用这种关键字风格。

source: For example, the organisation my.company would then be represented as my/company.
zh_cn: 例如，组织my.company将表示为my/company。

source: For example, to create a Java library project simply execute: gradle init --type java-library.
zh_cn: 例如，要创建一个 Java library 项目，只需执行: gradle init --type java-library。

source: For example, with the default status scheme in place, latest.integration will select the highest module version regardless of its status (because integration is the least mature status), whereas latest.release will select the highest module version with status release.
zh_cn: 例如，在适当的位置使用默认的状态模式，latest.integration将选择最高的模块版本，不论其状态（因为integration是成熟度最低的状态），而latest.release将选择release状态的最高模块版本。

source: For example, you can use it to expand the archive by copying the contents, or to merge some archives into another.
zh_cn: 例如，您可以用它来通过复制内容扩大归档，或把一些档案合并到另一个归档文件中。

source: For example, you could start by importing your existing Ant build.
zh_cn: 例如，你可以通过导入您现有的 Ant 构建来开始。

source: For example, you execute the Ant echo task by calling the ant.echo() method.
zh_cn: 例如，你可以通过调用ant.echo()方法执行 Ant 的 echo 任务。

source: For example, you may not wish to sign artifacts for non release versions.
zh_cn: 例如，你可能不想对非发布版本签名artifacts。

source: For example, you might use a source set to define an integration test suite, or you might use separate source sets to define the API and implementation classes of your project.
zh_cn: 例如，你可能会使用一个源集来定义一个集成测试套件，或者你可能会使用单独的源集来定义你的项目的 API 和实现类。
